zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ1038CA70144.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no"?><edc:PIC xmlns:edc="http://crownking/edc" xmlns:atdf="http://crownking/atdf" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" atdf:architecture="CORTEX-M7" atdf:family="PIC32CZ" edc:arch="arm32bit" edc:atsamname="ATSAME70Q20" edc:hasfreeze="false" edc:name="PIC32CZ1038CA70144" edc:procid="0x0000" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VDD edc:maxvoltage="3.6" edc:minvoltage="1.62" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:ArchDef edc:desc="arm32bit" edc:name="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv7m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset" edc:irq="-15"/>
    <edc:Interrupt edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted" edc:irq="-14"/>
    <edc:Interrupt edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault" edc:irq="-13"/>
    <edc:Interrupt edc:cname="MemoryManagement" edc:desc="Memory Management, MPU mismatch, including Access Violation and No Match" edc:irq="-12"/>
    <edc:Interrupt edc:cname="BusFault" edc:desc="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault" edc:irq="-11"/>
    <edc:Interrupt edc:cname="UsageFault" edc:desc="Usage Fault, i.e. Undef Instruction, Illegal State Transition" edc:irq="-10"/>
    <edc:Interrupt edc:cname="SVCall" edc:desc="System Service Call via SVC instruction" edc:irq="-5"/>
    <edc:Interrupt edc:cname="DebugMonitor" edc:desc="Debug Monitor" edc:irq="-4"/>
    <edc:Interrupt edc:cname="PendSV" edc:desc="Pendable request for system service" edc:irq="-2"/>
    <edc:Interrupt edc:cname="SysTick" edc:desc="System Tick Timer" edc:irq="-1"/>
    <edc:Interrupt edc:cname="SUPC" edc:desc="Supply Controller" edc:irq="0"/>
    <edc:Interrupt edc:cname="RSTC" edc:desc="Reset Controller" edc:irq="1"/>
    <edc:Interrupt edc:cname="RTC" edc:desc="Real Time Clock" edc:irq="2"/>
    <edc:Interrupt edc:cname="RTT" edc:desc="Real Time Timer" edc:irq="3"/>
    <edc:Interrupt edc:cname="WDT" edc:desc="Watchdog Timer" edc:irq="4"/>
    <edc:Interrupt edc:cname="PMC" edc:desc="Power Management Controller" edc:irq="5"/>
    <edc:Interrupt edc:cname="EFC" edc:desc="Enhanced Embedded Flash Controller" edc:irq="6"/>
    <edc:Interrupt edc:cname="UART0" edc:desc="UART 0" edc:irq="7"/>
    <edc:Interrupt edc:cname="UART1" edc:desc="UART 1" edc:irq="8"/>
    <edc:Interrupt edc:cname="PORTA" edc:desc="Port A" edc:irq="10"/>
    <edc:Interrupt edc:cname="PORTB" edc:desc="Port B" edc:irq="11"/>
    <edc:Interrupt edc:cname="PORTC" edc:desc="Port C" edc:irq="12"/>
    <edc:Interrupt edc:cname="USART0" edc:desc="USART 0" edc:irq="13"/>
    <edc:Interrupt edc:cname="USART1" edc:desc="USART 1" edc:irq="14"/>
    <edc:Interrupt edc:cname="USART2" edc:desc="USART 2" edc:irq="15"/>
    <edc:Interrupt edc:cname="PORTD" edc:desc="Port D" edc:irq="16"/>
    <edc:Interrupt edc:cname="PORTE" edc:desc="Port E" edc:irq="17"/>
    <edc:Interrupt edc:cname="HSMCI" edc:desc="Multimedia Card Interface" edc:irq="18"/>
    <edc:Interrupt edc:cname="TWI0" edc:desc="Two Wire Interface 0" edc:irq="19"/>
    <edc:Interrupt edc:cname="TWI1" edc:desc="Two Wire Interface 1" edc:irq="20"/>
    <edc:Interrupt edc:cname="SPI0" edc:desc="Serial Peripheral Interface 0" edc:irq="21"/>
    <edc:Interrupt edc:cname="SSC" edc:desc="Synchronous Serial Controller" edc:irq="22"/>
    <edc:Interrupt edc:cname="TC0_CH0" edc:desc="Timer/Counter 0 Channel 0" edc:irq="23"/>
    <edc:Interrupt edc:cname="TC0_CH1" edc:desc="Timer/Counter 0 Channel 1" edc:irq="24"/>
    <edc:Interrupt edc:cname="TC0_CH2" edc:desc="Timer/Counter 0 Channel 2" edc:irq="25"/>
    <edc:Interrupt edc:cname="TC1_CH0" edc:desc="Timer/Counter 1 Channel 0" edc:irq="26"/>
    <edc:Interrupt edc:cname="TC1_CH1" edc:desc="Timer/Counter 1 Channel 1" edc:irq="27"/>
    <edc:Interrupt edc:cname="TC1_CH2" edc:desc="Timer/Counter 1 Channel 2" edc:irq="28"/>
    <edc:Interrupt edc:cname="AFEC0" edc:desc="Analog Front End 0" edc:irq="29"/>
    <edc:Interrupt edc:cname="DACC" edc:desc="Digital To Analog Converter" edc:irq="30"/>
    <edc:Interrupt edc:cname="PWMC0" edc:desc="Pulse Width Modulation 0" edc:irq="31"/>
    <edc:Interrupt edc:cname="ICM" edc:desc="Integrity Check Monitor" edc:irq="32"/>
    <edc:Interrupt edc:cname="ACC" edc:desc="Analog Comparator" edc:irq="33"/>
    <edc:Interrupt edc:cname="USBHS" edc:desc="USB Host / Device Controller" edc:irq="34"/>
    <edc:Interrupt edc:cname="MCAN0" edc:desc="MCAN Controller 0" edc:irq="35"/>
    <edc:Interrupt edc:cname="MCAN1" edc:desc="MCAN Controller 1" edc:irq="37"/>
    <edc:Interrupt edc:cname="GMAC" edc:desc="Ethernet MAC" edc:irq="39"/>
    <edc:Interrupt edc:cname="AFEC1" edc:desc="Analog Front End 1" edc:irq="40"/>
    <edc:Interrupt edc:cname="TWI2" edc:desc="Two Wire Interface 2" edc:irq="41"/>
    <edc:Interrupt edc:cname="SPI1" edc:desc="Serial Peripheral Interface 1" edc:irq="42"/>
    <edc:Interrupt edc:cname="QSPI" edc:desc="Quad I/O Serial Peripheral Interface" edc:irq="43"/>
    <edc:Interrupt edc:cname="UART2" edc:desc="UART 2" edc:irq="44"/>
    <edc:Interrupt edc:cname="UART3" edc:desc="UART 3" edc:irq="45"/>
    <edc:Interrupt edc:cname="UART4" edc:desc="UART 4" edc:irq="46"/>
    <edc:Interrupt edc:cname="TC2_CH0" edc:desc="Timer/Counter 2 Channel 0" edc:irq="47"/>
    <edc:Interrupt edc:cname="TC2_CH1" edc:desc="Timer/Counter 2 Channel 1" edc:irq="48"/>
    <edc:Interrupt edc:cname="TC2_CH2" edc:desc="Timer/Counter 2 Channel 2" edc:irq="49"/>
    <edc:Interrupt edc:cname="TC3_CH0" edc:desc="Timer/Counter 3 Channel 0" edc:irq="50"/>
    <edc:Interrupt edc:cname="TC3_CH1" edc:desc="Timer/Counter 3 Channel 1" edc:irq="51"/>
    <edc:Interrupt edc:cname="TC3_CH2" edc:desc="Timer/Counter 3 Channel 2" edc:irq="52"/>
    <edc:Interrupt edc:cname="MLB" edc:desc="MediaLB" edc:irq="53"/>
    <edc:Interrupt edc:cname="AES" edc:desc="AES" edc:irq="56"/>
    <edc:Interrupt edc:cname="TRNG" edc:desc="True Random Generator" edc:irq="57"/>
    <edc:Interrupt edc:cname="XDMAC" edc:desc="DMA" edc:irq="58"/>
    <edc:Interrupt edc:cname="ISI" edc:desc="Camera Interface" edc:irq="59"/>
    <edc:Interrupt edc:cname="PWMC1" edc:desc="Pulse Width Modulation 1" edc:irq="60"/>
    <edc:Interrupt edc:cname="RSWDT" edc:desc="Reinforced Secure Watchdog Timer" edc:irq="63"/>
    <edc:Interrupt edc:cname="I2SC0" edc:desc="Inter-IC Sound controller" edc:irq="69"/>
    <edc:Interrupt edc:cname="I2SC1" edc:desc="Inter-IC Sound controller" edc:irq="70"/>
    <edc:Interrupt edc:cname="SDRAMC" edc:desc="SDRAM Controller" edc:irq="62"/>
  </edc:InterruptList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R0" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R1" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R2" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="8" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R3" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="12" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R4" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="16" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R5" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="20" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R6" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="24" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R7" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="28" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R8" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="32" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R9" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="36" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R10" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="40" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R11" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="44" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R12" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="48" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SP" edc:desc="Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="52" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MSP" edc:desc="Main Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="64" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PSP" edc:desc="Process Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="68" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LR" edc:desc="Link Register" edc:impl="0xFFFFFFFF" edc:mclr="11111111111111111111111111111111" edc:nmmrid="56" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PC" edc:desc="Program Counter" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="60" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnn--------nnnnnn-nnnnnnnnn" edc:cname="PSR" edc:desc="Program Status Register" edc:impl="0xFF00FDFF" edc:mclr="00000001000000000000000000000000" edc:nmmrid="72" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnn-------nnnn----------------" edc:cname="APSR" edc:desc="Application Program Status Register" edc:impl="0xF80F0000" edc:mclr="00000000000000000000000000000000" edc:nmmrid="76" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-----------------------rrrrrrrrr" edc:cname="IPSR" edc:desc="Interrupt Program Status Register" edc:impl="0x1FF" edc:mclr="00000000000000000000000000000000" edc:nmmrid="80" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-----rrr--------rrrrrr----------" edc:cname="EPSR" edc:desc="Execution Program Status Register" edc:impl="0x700FC00" edc:mclr="00000001000000000000000000000000" edc:nmmrid="84" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="-------------------------------n" edc:cname="PRIMASK" edc:desc="Priority Mask Register" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nmmrid="88" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-------------------------------n" edc:cname="FAULTMASK" edc:desc="Fault Mask Register" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nmmrid="92" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="------------------------nnnnnnnn" edc:cname="BASEPRI" edc:desc="Base Priority Mask Register" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nmmrid="96" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-----------------------------nnn" edc:cname="CONTROL" edc:desc="Control Register" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nmmrid="100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
    </edc:NMMRPlace>
    <edc:SFRDataSector edc:beginaddr="0x40000000" edc:endaddr="0x400E1EE8" edc:regionid="PERIPHERALS">
      <edc:SFRDef edc:_addr="0x40000000" edc:access="------------------------w---wwww" edc:cname="HSMCI_CR" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MCIEN" edc:desc="Multi-Media Interface Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCIDIS" edc:desc="Multi-Media Interface Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWSEN" edc:desc="Power Save Mode Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWSDIS" edc:desc="Power Save Mode Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000004" edc:access="---------------n-nnnnnnnnnnnnnnn" edc:cname="HSMCI_MR" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKDIV" edc:desc="Clock Divider" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PWSDIV" edc:desc="Power Saving Divider" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="RDPROOF" edc:desc="Read Proof Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRPROOF" edc:desc="Write Proof Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FBYTE" edc:desc="Force Byte Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PADV" edc:desc="Padding Value" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKODD" edc:desc="Clock divider is odd" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
