zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ1038CA70144.PIC
      <edc:SFRDef edc:_addr="0x400300D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN0_TXBCR" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CR0" edc:desc="Cancellation Request for Transmit Buffer 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR1" edc:desc="Cancellation Request for Transmit Buffer 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR2" edc:desc="Cancellation Request for Transmit Buffer 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR3" edc:desc="Cancellation Request for Transmit Buffer 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR4" edc:desc="Cancellation Request for Transmit Buffer 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR5" edc:desc="Cancellation Request for Transmit Buffer 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR6" edc:desc="Cancellation Request for Transmit Buffer 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR7" edc:desc="Cancellation Request for Transmit Buffer 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR8" edc:desc="Cancellation Request for Transmit Buffer 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR9" edc:desc="Cancellation Request for Transmit Buffer 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR10" edc:desc="Cancellation Request for Transmit Buffer 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR11" edc:desc="Cancellation Request for Transmit Buffer 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR12" edc:desc="Cancellation Request for Transmit Buffer 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR13" edc:desc="Cancellation Request for Transmit Buffer 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR14" edc:desc="Cancellation Request for Transmit Buffer 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR15" edc:desc="Cancellation Request for Transmit Buffer 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR16" edc:desc="Cancellation Request for Transmit Buffer 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR17" edc:desc="Cancellation Request for Transmit Buffer 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR18" edc:desc="Cancellation Request for Transmit Buffer 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR19" edc:desc="Cancellation Request for Transmit Buffer 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR20" edc:desc="Cancellation Request for Transmit Buffer 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR21" edc:desc="Cancellation Request for Transmit Buffer 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR22" edc:desc="Cancellation Request for Transmit Buffer 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR23" edc:desc="Cancellation Request for Transmit Buffer 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR24" edc:desc="Cancellation Request for Transmit Buffer 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR25" edc:desc="Cancellation Request for Transmit Buffer 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR26" edc:desc="Cancellation Request for Transmit Buffer 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR27" edc:desc="Cancellation Request for Transmit Buffer 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR28" edc:desc="Cancellation Request for Transmit Buffer 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR29" edc:desc="Cancellation Request for Transmit Buffer 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR30" edc:desc="Cancellation Request for Transmit Buffer 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR31" edc:desc="Cancellation Request for Transmit Buffer 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300D8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MCAN0_TXBTO" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TO0" edc:desc="Transmission Occurred for Buffer 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO1" edc:desc="Transmission Occurred for Buffer 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO2" edc:desc="Transmission Occurred for Buffer 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO3" edc:desc="Transmission Occurred for Buffer 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO4" edc:desc="Transmission Occurred for Buffer 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO5" edc:desc="Transmission Occurred for Buffer 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO6" edc:desc="Transmission Occurred for Buffer 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO7" edc:desc="Transmission Occurred for Buffer 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO8" edc:desc="Transmission Occurred for Buffer 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO9" edc:desc="Transmission Occurred for Buffer 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO10" edc:desc="Transmission Occurred for Buffer 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO11" edc:desc="Transmission Occurred for Buffer 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO12" edc:desc="Transmission Occurred for Buffer 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO13" edc:desc="Transmission Occurred for Buffer 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO14" edc:desc="Transmission Occurred for Buffer 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO15" edc:desc="Transmission Occurred for Buffer 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO16" edc:desc="Transmission Occurred for Buffer 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO17" edc:desc="Transmission Occurred for Buffer 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO18" edc:desc="Transmission Occurred for Buffer 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO19" edc:desc="Transmission Occurred for Buffer 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO20" edc:desc="Transmission Occurred for Buffer 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO21" edc:desc="Transmission Occurred for Buffer 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO22" edc:desc="Transmission Occurred for Buffer 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO23" edc:desc="Transmission Occurred for Buffer 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO24" edc:desc="Transmission Occurred for Buffer 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO25" edc:desc="Transmission Occurred for Buffer 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO26" edc:desc="Transmission Occurred for Buffer 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO27" edc:desc="Transmission Occurred for Buffer 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO28" edc:desc="Transmission Occurred for Buffer 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO29" edc:desc="Transmission Occurred for Buffer 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO30" edc:desc="Transmission Occurred for Buffer 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TO31" edc:desc="Transmission Occurred for Buffer 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300DC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MCAN0_TXBCF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CF0" edc:desc="Cancellation Finished for Transmit Buffer 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF1" edc:desc="Cancellation Finished for Transmit Buffer 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF2" edc:desc="Cancellation Finished for Transmit Buffer 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF3" edc:desc="Cancellation Finished for Transmit Buffer 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF4" edc:desc="Cancellation Finished for Transmit Buffer 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF5" edc:desc="Cancellation Finished for Transmit Buffer 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF6" edc:desc="Cancellation Finished for Transmit Buffer 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF7" edc:desc="Cancellation Finished for Transmit Buffer 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF8" edc:desc="Cancellation Finished for Transmit Buffer 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF9" edc:desc="Cancellation Finished for Transmit Buffer 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF10" edc:desc="Cancellation Finished for Transmit Buffer 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF11" edc:desc="Cancellation Finished for Transmit Buffer 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF12" edc:desc="Cancellation Finished for Transmit Buffer 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF13" edc:desc="Cancellation Finished for Transmit Buffer 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF14" edc:desc="Cancellation Finished for Transmit Buffer 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF15" edc:desc="Cancellation Finished for Transmit Buffer 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF16" edc:desc="Cancellation Finished for Transmit Buffer 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF17" edc:desc="Cancellation Finished for Transmit Buffer 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF18" edc:desc="Cancellation Finished for Transmit Buffer 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF19" edc:desc="Cancellation Finished for Transmit Buffer 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF20" edc:desc="Cancellation Finished for Transmit Buffer 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF21" edc:desc="Cancellation Finished for Transmit Buffer 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF22" edc:desc="Cancellation Finished for Transmit Buffer 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF23" edc:desc="Cancellation Finished for Transmit Buffer 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF24" edc:desc="Cancellation Finished for Transmit Buffer 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF25" edc:desc="Cancellation Finished for Transmit Buffer 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF26" edc:desc="Cancellation Finished for Transmit Buffer 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF27" edc:desc="Cancellation Finished for Transmit Buffer 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF28" edc:desc="Cancellation Finished for Transmit Buffer 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF29" edc:desc="Cancellation Finished for Transmit Buffer 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF30" edc:desc="Cancellation Finished for Transmit Buffer 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CF31" edc:desc="Cancellation Finished for Transmit Buffer 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
