zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ1038CA70144.PIC
      <edc:SFRDef edc:_addr="0x40038168" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR2" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:desc="CRC Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003816C" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR3" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:desc="CRC Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038170" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR4" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:desc="CRC Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038174" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR5" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:desc="CRC Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038178" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR6" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:desc="CRC Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003817C" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR7" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:desc="CRC Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038180" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR8" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:desc="CRC Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038184" edc:access="------------------------wwwwwwww" edc:cname="USBHS_DEVEPTICR9" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIC" edc:desc="Transmitted IN Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:desc="CRC Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETC" edc:desc="Short Packet Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038188" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40038190" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR0" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038194" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR1" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038198" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_DEVEPTIFR2" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:desc="Transmitted IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:desc="Received OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
