zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ1038CA70144.PIC
      <edc:SFRDef edc:_addr="0x400381D8" edc:access="------------rrrr-rrr-rrrrrrrrrrr" edc:cname="USBHS_DEVEPTIMR6" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFE" edc:desc="Underflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRE" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHE" edc:desc="High Bandwidth Isochronous IN Flush Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:desc="CRC Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAE" edc:desc="MData Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXE" edc:desc="DataX Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSE" edc:desc="Transaction Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381DC" edc:access="------------rrrr-rrr-rrrrrrrrrrr" edc:cname="USBHS_DEVEPTIMR7" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFE" edc:desc="Underflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRE" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHE" edc:desc="High Bandwidth Isochronous IN Flush Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:desc="CRC Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAE" edc:desc="MData Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXE" edc:desc="DataX Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSE" edc:desc="Transaction Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381E0" edc:access="------------rrrr-rrr-rrrrrrrrrrr" edc:cname="USBHS_DEVEPTIMR8" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFE" edc:desc="Underflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRE" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHE" edc:desc="High Bandwidth Isochronous IN Flush Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:desc="CRC Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAE" edc:desc="MData Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXE" edc:desc="DataX Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSE" edc:desc="Transaction Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381E4" edc:access="------------rrrr-rrr-rrrrrrrrrrr" edc:cname="USBHS_DEVEPTIMR9" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFE" edc:desc="Underflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRE" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHE" edc:desc="High Bandwidth Isochronous IN Flush Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:desc="CRC Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAE" edc:desc="MData Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXE" edc:desc="DataX Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSE" edc:desc="Transaction Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400381E8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400381F0" edc:access="------------wwww-www-wwwwwwwwwww" edc:cname="USBHS_DEVEPTIER0" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINES" edc:desc="Transmitted IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:desc="Received OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:desc="Underflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:desc="CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:desc="MData Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:desc="DataX Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:desc="Transaction Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:desc="Endpoint Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:desc="NYET Token Disable Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:desc="STALL Request Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381F4" edc:access="------------wwww-www-wwwwwwwwwww" edc:cname="USBHS_DEVEPTIER1" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINES" edc:desc="Transmitted IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:desc="Received OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:desc="Underflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:desc="CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:desc="MData Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:desc="DataX Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:desc="Transaction Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:desc="Endpoint Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:desc="NYET Token Disable Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:desc="STALL Request Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381F8" edc:access="------------wwww-www-wwwwwwwwwww" edc:cname="USBHS_DEVEPTIER2" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINES" edc:desc="Transmitted IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:desc="Received OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:desc="Underflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:desc="CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:desc="MData Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:desc="DataX Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:desc="Transaction Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:desc="Endpoint Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:desc="NYET Token Disable Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:desc="STALL Request Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381FC" edc:access="------------wwww-www-wwwwwwwwwww" edc:cname="USBHS_DEVEPTIER3" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINES" edc:desc="Transmitted IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:desc="Received OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:desc="Underflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:desc="CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:desc="MData Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:desc="DataX Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:desc="Transaction Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:desc="Endpoint Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:desc="NYET Token Disable Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:desc="STALL Request Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
