zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ1038CA70144.PIC
      <edc:SFRDef edc:_addr="0x40050644" edc:access="--------------------nn--nnn--nn-" edc:cname="GMAC_IMRPQ1" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AHB" edc:desc="AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050648" edc:access="--------------------nn--nnn--nn-" edc:cname="GMAC_IMRPQ2" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AHB" edc:desc="AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005064C" edc:access="--------------------nn--nnn--nn-" edc:cname="GMAC_IMRPQ3" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AHB" edc:desc="AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050650" edc:access="--------------------nn--nnn--nn-" edc:cname="GMAC_IMRPQ4" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AHB" edc:desc="AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050654" edc:offset="0x8C"/>
      <edc:SFRDef edc:_addr="0x400506E0" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2ER0" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Ethertype Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400506E4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2ER1" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Ethertype Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400506E8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2ER2" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Ethertype Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400506EC" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2ER3" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Ethertype Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400506F0" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x40050700" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW00" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050704" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW10" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050708" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW01" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005070C" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW11" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
