zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ1038CA70144.PIC
      <edc:SFRDef edc:_addr="0x40068094" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MLB_HCER1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CERR" edc:desc="Bitwise Channel Error Bit [31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40068098" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MLB_HCBR0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHB" edc:desc="Bitwise Channel Busy Bit [31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006809C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MLB_HCBR1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHB" edc:desc="Bitwise Channel Busy Bit [31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400680A0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x400680C0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDAT0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="CRT or DBR Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680C4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDAT1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="CRT or DBR Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680C8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDAT2" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="CRT or DBR Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680CC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDAT3" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="CRT or DBR Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680D0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDWE0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Bitwise Write Enable for CTR Data - bits[31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDWE1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Bitwise Write Enable for CTR Data - bits[31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680D8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDWE2" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Bitwise Write Enable for CTR Data - bits[31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680DC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDWE3" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Bitwise Write Enable for CTR Data - bits[31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680E0" edc:access="-------------------------------n" edc:cname="MLB_MCTL" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="XCMP" edc:desc="Transfer Complete (Write 0 to Clear)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680E4" edc:access="nn----------------nnnnnnnnnnnnnn" edc:cname="MLB_MADR" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="CTR or DBR Address" edc:nzwidth="0xE"/>
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="TB" edc:desc="Target Location Bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CTR" edc:desc="Selects CTR" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DBR" edc:desc="Selects DBR" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WNR" edc:desc="Write-Not-Read Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400680E8" edc:offset="0x2D8"/>
      <edc:SFRDef edc:_addr="0x400683C0" edc:access="---------------------------n-nnn" edc:cname="MLB_ACTL" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCE" edc:desc="Software Clear Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMX" edc:desc="AHB Interrupt Mux Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_MODE" edc:desc="DMA Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MPB" edc:desc="DMA Packet Buffering Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SINGLE_PACKET" edc:desc="Single-packet mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE_PACKET" edc:desc="Multiple-packet mode" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400683C4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x400683D0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_ACSR0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHS" edc:desc="Interrupt Status for Logical Channels [31:0] (cleared by writing a 1)" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400683D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_ACSR1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHS" edc:desc="Interrupt Status for Logical Channels [31:0] (cleared by writing a 1)" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400683D8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_ACMR0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHM" edc:desc="Bitwise Channel Mask Bits 31 to 0" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400683DC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_ACMR1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHM" edc:desc="Bitwise Channel Mask Bits 31 to 0" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400683E0" edc:offset="0x3C20"/>
      <edc:SFRDef edc:_addr="0x4006C000" edc:access="---------------w-------w-------w" edc:cname="AES_CR" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="START" edc:desc="Start Processing" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="LOADSEED" edc:desc="Random Number Generator Seed Loading" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C004" edc:access="--nnnnnnnnnn-nnnnnnnnnnnnnnnn-nn" edc:cname="AES_MR" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CIPHER" edc:desc="Processing Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GTAGEN" edc:desc="GCM Automatic Tag Generation Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DUALBUFF" edc:desc="Dual Input Buffer" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="INACTIVE" edc:desc="AES_IDATARx cannot be written during processing of previous block." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="AES_IDATARx can be written during processing of previous block when SMOD = 2. It speeds up the overall runtime of large files." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PROCDLY" edc:desc="Processing Delay" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SMOD" edc:desc="Start Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MANUAL_START" edc:desc="Manual Mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AUTO_START" edc:desc="Auto Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IDATAR0_START" edc:desc="AES_IDATAR0 access only Auto Mode (DMA)" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="KEYSIZE" edc:desc="Key Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="AES128" edc:desc="AES Key Size is 128 bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AES192" edc:desc="AES Key Size is 192 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AES256" edc:desc="AES Key Size is 256 bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:desc="Operating Mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="ECB" edc:desc="ECB: Electronic Code Book mode" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CBC" edc:desc="CBC: Cipher Block Chaining mode" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFB" edc:desc="OFB: Output Feedback mode" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CFB" edc:desc="CFB: Cipher Feedback mode" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CTR" edc:desc="CTR: Counter mode (16-bit internal counter)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCM" edc:desc="GCM: Galois/Counter mode" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LOD" edc:desc="Last Output Data Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFBS" edc:desc="Cipher Feedback Data Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SIZE_128BIT" edc:desc="128-bit" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_64BIT" edc:desc="64-bit" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_32BIT" edc:desc="32-bit" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_16BIT" edc:desc="16-bit" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_8BIT" edc:desc="8-bit" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CKEY" edc:desc="Countermeasure Key" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="This field must be written with 0xE to allow CMTYPx bit configuration changes. Any other values will abort the write operation in CMTYPx bits.Always reads as 0." edc:when="(field &amp; 0xF) == 0xE"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMTYP1" edc:desc="Countermeasure Type 1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOPROT_EXTKEY" edc:desc="Countermeasure type 1 is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROT_EXTKEY" edc:desc="Countermeasure type 1 is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMTYP2" edc:desc="Countermeasure Type 2" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_PAUSE" edc:desc="Countermeasure type 2 is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PAUSE" edc:desc="Countermeasure type 2 is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMTYP3" edc:desc="Countermeasure Type 3" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_DUMMY" edc:desc="Countermeasure type 3 is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DUMMY" edc:desc="Countermeasure type 3 is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMTYP4" edc:desc="Countermeasure Type 4" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_RESTART" edc:desc="Countermeasure type 4 is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RESTART" edc:desc="Countermeasure type 4 is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMTYP5" edc:desc="Countermeasure Type 5" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_ADDACCESS" edc:desc="Countermeasure type 5 is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ADDACCESS" edc:desc="Countermeasure type 5 is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMTYP6" edc:desc="Countermeasure Type 6" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_IDLECURRENT" edc:desc="Countermeasure type 6 is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IDLECURRENT" edc:desc="Countermeasure type 6 is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4006C008" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4006C010" edc:access="---------------w-------w-------w" edc:cname="AES_IER" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:desc="Data Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Unspecified Register Access Detection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TAGRDY" edc:desc="GCM Tag Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C014" edc:access="---------------w-------w-------w" edc:cname="AES_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:desc="Data Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Unspecified Register Access Detection Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TAGRDY" edc:desc="GCM Tag Ready Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
