zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ1038CA70144.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25"/>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="CTS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A23" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="MCCK" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD20"/>
      <edc:VirtualPin edc:name="PD20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SPI0_MISO" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD28"/>
      <edc:VirtualPin edc:name="PD28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="URXD3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CANRX1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TWCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D9" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WKUP5" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD16"/>
      <edc:VirtualPin edc:name="PD16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTX3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TXD2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RAS" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4"/>
      <edc:VirtualPin edc:name="PA4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWCK0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PORTDC1" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP3" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE5"/>
      <edc:VirtualPin edc:name="PE5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AFEC0_AD3" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7"/>
      <edc:VirtualPin edc:name="PA7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="XIN32" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3"/>
      <edc:VirtualPin edc:name="PC3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWML3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23"/>
      <edc:VirtualPin edc:name="PA23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCK1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A19" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMC1_PWML2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15"/>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMC0_PWML3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="I2SC0_WS" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD26"/>
      <edc:VirtualPin edc:name="PD26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24"/>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RTS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A20" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_PCK" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5"/>
      <edc:VirtualPin edc:name="PC5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA6" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10"/>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="UTXD0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMEXTRG0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RD" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PORTDC4" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12"/>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PORTDC6" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD17"/>
      <edc:VirtualPin edc:name="PD17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTXER" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="CAS" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC28"/>
      <edc:VirtualPin edc:name="PC28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI1_NPCS1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD30"/>
      <edc:VirtualPin edc:name="PD30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="UTXD3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="ISI_D10" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AFEC0_AD0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA8"/>
      <edc:VirtualPin edc:name="PA8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AFEC0_ADTRG" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="XOUT32" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13"/>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMC1_PWML1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PORTDC7" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC7"/>
      <edc:VirtualPin edc:name="PC7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK6" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD25"/>
      <edc:VirtualPin edc:name="PD25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SPI0_NPCS1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="URXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_VSYNC" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD24"/>
      <edc:VirtualPin edc:name="PD24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RF" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TCLK11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_HSYNC" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD23"/>
      <edc:VirtualPin edc:name="PD23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCK" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD22"/>
      <edc:VirtualPin edc:name="PD22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SPI0_SPCK" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TIOB11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD19"/>
      <edc:VirtualPin edc:name="PD19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CTS2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD4" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD18"/>
      <edc:VirtualPin edc:name="PD18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RTS2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="URXD4" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5"/>
      <edc:VirtualPin edc:name="PA5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC1_PWML3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="ISI_D4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="URXD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PORTDC2" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP4" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA9"/>
      <edc:VirtualPin edc:name="PA9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="URXD0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="ISI_D3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMC0_PWMFI0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PORTDC3" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP6" edc:ppsfunction="X1"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>